<template>
  <div class="w-100 h-100 overflow-auto">
    <h1 class="mb-0 py-2 bg-primary">تست sc190</h1>
    <div
      class="w-100 py-3 text-right border-top border-secondary pr-3"
      style="direction:rtl;"
      v-for="(q,i) in questions"
      :key="i"
      :ref="'q-'+i"
    >
      <div class="col-12 mb-3 font-weight-bold">{{(i+1)+"- "+q}}</div>
      <div class="w-100">
        <div
          class="col-12 pb-2 form-check text-right d-flex answer-item"
          v-for="(j,k) in answers"
          :key="j"
        >
          <label
            @click="scrolltonext(i)"
            class="form-check-label flex-grow-1 pr-2"
            :for="'qid'+i+'_'+j"
          >
            <input
              class="form-check-input"
              type="radio"
              v-model="results[i]"
              :name="'q'+i"
              :id="'qid'+i+'_'+j"
              :value="k+1"
              checked
            />
            <span class="pr-4">{{j}}</span>
          </label>
        </div>
      </div>
    </div>
    <div class="w-100 overflow-auto">
    <table class="table table-striped table-dark w-100">
      <thead>
        <tr>
          <th
            scope="col"
            v-for="c in resulttable.length*2"
            :key="c"
          >{{c%2==0? resulttable[Math.floor((c)/2)-1].lable:"#"}}</th>
        </tr>
      </thead>
      <tbody>
        <tr v-for="row in rowQty" :key="row">
          <td v-for="c in resulttable.length*2" :key="c">
            <span v-if="resulttable[Math.ceil(c/2)-1].questionNos[row-1]">
            <span  v-if="c%2==0">
              {{results[resulttable[Math.floor(c/2)-1].questionNos[row-1]-1]}}
            </span>
            <span style="color:gray" v-else>
              {{resulttable[Math.floor(c/2)].questionNos[row-1]}}
            </span>
            </span>
          </td>
        </tr>
        <tr>
          <td v-for="c in resulttable.length*2" :key="c">
            <span v-if="c%2==0">
              {{resulttable[Math.floor(c/2)-1].questionNos.reduce((cu,c)=>(results[c-1]||0)+cu,0)}}
            </span>
          </td>
        </tr>
      </tbody>
    </table>
    </div>
  </div>
</template>
<style lang="scss" scoped>
.answer-item:not(:last-of-type) {
  border-bottom: 1px dashed rgb(0, 123, 255);
}
</style>

<script>
export default {
  data() {
    let questions = [
      "يا از هفته گذشته تا به امروز سردرد داشتهايد؟",
      "آيا از هفته گذشته تا به امروز عصبی بودهايد و از داخل بدن احساس لرزش داشتهايد؟",
      "آيا از هفته گذشته تا به امروز افکار، عقايد يا کلمات ناخوشايند و نامربوطی مرتبا وارد ذهن ما شدهاند که رهايتان نکند؟",
      "آيا از هفته گذشته تا به امروز دچار ضعف، بیحالی و يا سرگیجه بودهايد؟",
      "آيا از هفته گذشته تا به امروز نسبت به روابط زناشويی بیمیل شدهايد؟",
      "آيا از هفته گذشته تا به امروز ايرادگیر و بهانهجو شدهايد؟",
      "آيا از هفته گذشته تا به امروز اين اعتقاد را داشتهايد که شخص ديگری میتواند افکار شما را از راه دور کنترل کند؟",
      "آيا از هفته گذشته تا به امروز احساس کردهايد که ديگران باعث ناراحتیها و گرفتاریهای ما هستند؟",
      "آيا از هفته گذشته تا به امروز فراموشکار شدهايد؟",
      "آيا از هفته گذشته تا به امروز در کارها بیتوجه و بیدقت شدهايد؟",
      "آيا از هفته گذشته تا به امروز دلخور يا عصبی شدهايد؟",
      "آيا از هفته گذشته تا به امروز درد در ناحیه قلب يا سینه داشتهايد؟",
      "آيا از هفته گذشته تا به امروز از رفتن به جاهای باز يا به خیابان احساس ترس کردهايد؟",
      "آيا از هفته گذشته تا به امروز احساس کردهايد کهه قهدرت و بنیهه سهابا را نداريهد و زود خسته میشويد؟",
      "آيا از هفته گذشته تا به امروز اين فکر به ذهنتان آمده که به زندگی خود خاتمه دهید؟",
      "آيا از هفته گذشته تا به امروز صداهايی به گوشتان میآيد که ديگران نمیتوانستند آنها را بشنوند؟",
      "آيا از هفته گذشته تا به امروز احساس لرزش در اندام بدن خود داشتهايد؟",
      "آيا از هفته گذشته تا به امروز اين احساس را داشتهايد که به بیشتر مردم نمیشود اعتمهاد کرد؟",
      "آيا از هفته گذشته تا به امروز زود به گريه میافتید؟",
      "آيا از هفته گذشته تا به امروز بیاشتها شدهايد؟",
      "آيا از هفته گذشته تا به امروز در روابط اجتماعی و يا در رابطه با ديگران احساس خجالت کردهايد؟",
      "آيا از هفته گذشته تا به امروز اين احساس را داشتهايد که در يک بنبست گیهر کهرده ايهد که راه پس و پیش نداريد؟",
      "آيا از هفته گذشته تا به امروز ناگهان و بدون دلیل دچار ترس شدهايد؟",
      "آيا از هفته گذشته تا به امروز طوری عصبانی شدهايد که نتوانید جلوی خودتان را بگیريهد )به اصطالح از کوره در رفتهايد(؟",
      "آيا از هفته گذشته تا به امروز اين احساس را داشتهايه د کهه بترسهید تنهها از خانهه بیهرون برويد؟",
      "آيا از هفته گذشته تا به امروز برای هر چیز کوچکی، خود را سرزنش کردهايد؟",
      "آيا از هفته گذشته تا به امروز کمردرد داشتهايد؟ آيا از هفته گذشته تا به امروز احساس کردهايد که کارهايتان پیشرفت نمیکند؟",
      "آيا از هفته گذشته تا به امروز احساس تنهايی کردهايد؟",
      "آيا از هفته گذشته تا به امروز احساس غمگینی کردهايد؟",
      "آيا از هفته گذشته تا به امروز برای هر چیزی به شدت نگران و دلواپس شدهايد؟",
      "آيا از هفته گذشته تا به امروز نسبت به همه چیز بیعالقه شدهايد؟",
      "آيا از هفته گذشته تا به امروز احساس ترس داشتهايد؟",
      "آيا از هفته گذشته تا به امروز حساس و زودرنج شدهايد؟",
      "آيا از هفته گذشته تا به امروز اين احساس را داشتهايد که سايرين از افکار خصوصهی شهما که به کسی نگفتهايد، با خبر میشوند؟",
      "آيا از هفته گذشته تا به امروز اين اعتقاد را داشتهايد که ديگران شما را درک نمیکننهد و يا با شما همدردی نمیکنند؟",
      "آيا از هفته گذشته تا به امروز اين احساس را داشتهايد که مهردم نسهبت بهه شهما مهربهان نیستند يا شما را دوست ندارند؟",
      "آيا از هفته گذشته تا به امروز برای اينکه کارها را درسهت انجهام بدهیهد مجبهور بهوده ايهد آهسته کار کنید؟",
      "آيا از هفته گذشته تا به امروز تپش قلب داشتهايد؟",
      "آيا از هفته گذشته تا به امروز حالت تهوع يا دل بهم خوردگی داشتهايد؟",
      "آيا از هفته گذشته تا به امروز احساس حقارت داشتهايهد يها خهود را از ديگهران کمتهر يها پايینتر حس کردهايد؟",
      "آيا از هفته گذشته تا به امروز احساس درد و کوفتگی در عضالت بدنتان داشتهايد؟",
      "آيا از هفته گذشته تا به امروز اين احساس را داشتهايد که ديگران شما را زيرنظر دارند يها درباره شما حرف میزنند؟",
      "آيا از هفته گذشته تا به امروز در به خواب رفتن مشکل داشتهايد؟",
      "آيا از هفته گذشته تا به امروز وقتی کاری را انجام میداديد مجبور بودهايد آن را چنهد بهار تکرار کنید تا مطمئن شويد درست انجام دادهايد؟ مثال در را چند بهار امتاهان کنیهد کهه ببینید بسته است يا خیر؟",
      "آيا از هفته گذشته تا به امروز در تصمیم گرفتن مشکل داشتهايد؟",
      "آيا از هفته گذشته تا به امروز از مسافرت با اتوبوس يا قطار، احساس ترس کردهايد؟",
      "آيا از هفته گذشته تا به امروز احساس تنگی نفس داشتهايد؟",
      "آيا از هفته گذشته تا به امروز دچار حالت گرگرفتگی يا سرما سرما شده ايد ؟",
      "آيا از هفته گذشته تا به امروز مجبور بودهايد بعضی کارها را نکنید يا بعضی جاها نرويد؟",
      "آيا از هفته گذشته تا به امروز اتفاق افتاده که حس کنید مغزتان کار نمیکند؟",
      "آيا از هفته گذشته تا به امروز احساس کردهايد بدنتان خهواب میهرود يها گزگز)مهور مهور( میشود؟",
      "آيا از هفته گذشته تا به امروز در گلويتان احساس گرفتگی کردهايد مثل اينکهه چیهزی در گلويتان گیر کرده باشد؟",
      "آيا از هفته گذشته تا به امروز احساس کردهايد که نسبت به آينده امید خهود را از دسهت دادهايد؟",
      "آيا از هفته گذشته تا به امروز تمرکز حواس نداشتهايد؟ يعنی در جمع کردن حواس خهود روی کارها مشکل داشتهايد؟",
      "آيا از هفته گذشته تا به امروز در بعضی از قسمتهای بدن خود احساس ضهعف و سسهتی داشتهايد؟",
      "آيا از هفته گذشته تا به امروز دچار فشارهای روحی و گرفتگی بودهايد؟",
      "آيا از هفته گذشته تا به امروز در دستها و پاها احساس سنگینی کردهايد؟",
      "آيا از هفته گذشته تا به امروز زياد به فکر مرگ و مردن بودهايد؟",
      "آيا از هفته گذشته تا به امروز پرخوری داشتهايد؟",
      "آيا از هفته گذشته تا به امروز وقتی مردم به شما نگاه میکنند يا درباره شما حرف میزنند احساس ناراحتی میکنید؟",
      "آيا از هفته گذشته تا به امروز افکاری به ذهنتان آمده که حس کنید مال خودتان نیست و ديگران آنها را توی مغز شما گذاشتهاند؟",
      "آيا از هفته گذشته تا به امروز در خودتان میهل شهديدی بهه آزار رسها ندن و زدن ديگهران احساس کردهايد؟",
      "آيا از هفته گذشته تا به امروز بعضی صبحها زودتر از حد معمول بیدار شدهايد؟",
      "آيا از هفته گذشته تا به امروز مجبور بودهايد بعضی کارها همچون شستن، شمردن و دست زدن به اشیاء را تکرار کنید؟",
      "آيا از هفته گذشته تا به امروز دچار بدخوابی بودهايد و يا چندين بار در شب از خواب بیدار شدهايد؟",
      "آيا از هفته گذشته تا به امروز میل شديدی به شکستن اشیاء و خرد کردن آنها داشتهايد؟",
      "آيا از هفته گذشته تا به امروز اين احساس را داشتهايد که دارای افکهار و عقا يهدی هسهتید که مخصوص خودتان است و ديگران آن عقايد و افکار را ندارند؟",
      "آيا از هفته گذشته تا به امروز در موقع روبهرو شهدن بها ديگهران زيهاد از حهد بهه رفتهار و حرکات خود توجه داشتهايد؟",
      "آيا از هفته گذشته تا به امروز وقتی در جمهع بهوده ايهد و همچنهین در بهازار و مهمهانی هها احساس ناراحتی کردهايد؟",
      "آيا از هفته گذشته تا به امروز حتی کارهای کوچک برايتان سخت و مشکل بوده است؟",
      "آيا از هفته گذشته تا به امروز دچار هول و وحشتزدگی شدهايد؟",
      "آيا از هفته گذشته تا به امروز در مقابل ديگران يا جمع، از اينکه چیزی بخوريد، احسهاس ناراحتی کردهايد؟",
      "آيا از هفته گذشته تا به امروز با مردم زياد جر و باث و درگیری داشتهايد؟",
      "آيا از هفته گذشته تا به امروز از تنها ماندن ترس و واهمه داشتهايد؟",
      "آيا از هفته گذشته تا به امروز اين احساس را داشتهايد که ديگران ارزشی برای کارهايتهان قائل نیستند؟",
      "آيا از هفته گذشته تا به امروز حتی وقتی با ديگران بودهايد احساس تنهايی کردهايد؟",
      "آيا از هفته گذشته تا به امروز گاهی طوری ناراحت و بیقرار شدهايد که نتوانیهد يکجها آرام بگیريد؟",
      "آيا از هفته گذشته تا به امروز احساس بیمصرفی و بدرد نخوردن داشتهايد؟",
      "آيا از هفته گذشته تا به امروز اين حساس را داشتهايد که اتفاق بدی برايتان خواهد افتاد؟",
      "آيا از هفته گذشته تا به امروز داد و فرياد راه انداختهايد و يا چیزهايی را پرتاب کردهايد؟",
      "آيا از هفته گذشته تا به امروز ترس افتادن و از حال رفتن در کوچه و خیابان يها در انظهار مردم داشتهايد؟",
      "آيا از هفته گذشته تا به امروز ترس از اينکه اگر به ديگران رو بدهیهد از شهما سوءاسه تفاده میکنند، داشتهايد؟",
      "آيا از هفته گذشته تا به امروز درباره امور جنسی افکاری داشتهايد که شما را نگران کند؟",
      "آيا از هفته گذشته تا به امروز اين اعتقاد را داشتهايد که بهه خهاطر گناههانی کهه مرتکهب شدهايد مستوجب تنبیه و مجازات هستید؟",
      "آيا از هفته گذشته تا به امروز اعتقاد و تصورات ترسآمیز داشتهايد؟",
      "آيا از هفته گذشته تا به امروز اين احساس را داشتهايد که عیب و نقص مهمی در بهدنتان پیدا شده است؟",
      "آيا از هفته گذشته تا به امروز احساس کردهايد که در اين دنیا با کسی صمیمی نیستید؟",
      "آيا از هفته گذشته تا به امروز احساس گناه و تقصیر داشتهايد؟",
      "آيا از هفته گذشته تا به امروز احساس کردهايد که دچار بیماری فکری شدهايد؟"
    ];

    let resulttable = [
      {
        lable: "t1",
        questionNos: [1, 2, 3, 4, 5, 6, 7]
      },
      {
        lable: "t2",
        questionNos: [8, 9, 10, 11, 12, 13]
      },
      {
        lable: "t3",
        questionNos: [14, 15, 16, 17, 18, 19, 20, 21, 22, 23]
      },
      {
        lable: "t4",
        questionNos: [24, 25, 26, 27, 28, 29, 30, 31, 32, 33]
      },
      {
        lable: "t5",
        questionNos: [34, 35, 36, 37, 38, 39, 40, 41, 42]
      },
      {
        lable: "t6",
        questionNos: [43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54]
      },
      {
        lable: "t7",
        questionNos: [55, 56, 57, 58, 59, 60, 61, 62, 63, 64]
      },
      {
        lable: "t8",
        questionNos: [65, 66, 67, 68, 69, 70]
      },
      {
        lable: "t9",
        questionNos: [71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83]
      },
      {
        lable: "t10",
        questionNos: [84, 85, 86, 87, 88, 89, 90]
      }
    ];
    return {
      questions,
      answers: ["هیچ", "کمی", "تاحدی", "زیاد", "خیلی زیاد"],
      results: Array(questions.length),
      resulttable,
      rowQty: resulttable.reduce(
        (cu, c) => Math.max(cu, c.questionNos.length),
        0
      )
    };
  },
  created() {},
  methods: {
    scrolltonext(i) {
      let el = this.$refs["q-" + (i + 1)];
      if (el) el[0].scrollIntoView({ behavior: "smooth", block: "start" });
    }
  }
};
</script>
